tests/loadtest/app-test.yaml
config:
  target: "http://localhost:3000"
  phases:
    # 10초 동안 5명의 유저가 초당 1번씩 request 한다.
    - duration : 10
      arrivalRate: 5
      name: Warm up

    # 10초 동안 가상유저가 5명에서 50까지 증가한다.
    - duration: 10
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load

    # 10초 동안 가상유저가 100명으로 유지한다.
    - duration : 30
      arrivalRate : 100
      name: Sustained load

scenarios:
  - name: "localhost:3000"
    flow:
      - get:
          url: "/"